🚀&nbsp; env0 had composed a PR Plan for environment [ACME Financial Services / Demos / Environment Discovery / dev / workflows/b1-compute ](https://app.env0.com/p/c12c6949-9a00-4ebd-841f-e75529a9cfcb/environments/0eadbf4a-2463-4aa4-a770-e0b953cdd11f?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:


  # module.compute.random_string.random will be created
+   resource "random_string" "random" {
+       id               = (known after apply)
+       keepers          = {
+           "refresh_token" = "0"
        }
+       length           = 5
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       numeric          = true
+       override_special = "-._~"
+       result           = (known after apply)
+       special          = false
+       upper            = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   cluster_name = "acme-fitness-cluster"
+   instance_id  = (known after apply)
+   network      = "vpc-0d806cc612e6cf9e3"
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ENV0_INSTALLED_TOOLS"
│ but a value was found in file "env0.auto.tfvars.json". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/c12c6949-9a00-4ebd-841f-e75529a9cfcb/environments/0eadbf4a-2463-4aa4-a770-e0b953cdd11f/deployments/4ef6b389-cb42-4542-849e-7e141e095180?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92)

[Get instant insights with AI Summary](https://app.env0.com/p/c12c6949-9a00-4ebd-841f-e75529a9cfcb/environments/0eadbf4a-2463-4aa4-a770-e0b953cdd11f/deployments/4ef6b389-cb42-4542-849e-7e141e095180?organizationId=bde19c6d-d0dc-4b11-a951-8f43fe49db92&ai-analyzer=plan-summary)